In [2]:
import pandas as pd 
import numpy as np

In [3]:
people = {
    'first' : ['Alex', 'Donald', 'Phillipa', np.nan, None, 'NA'],
    'last' : ['McIntosh', 'Smith', 'Jones', np.nan, np.nan, 'Missing'],
    'email' : ['alexmc124@gmail.com','donald88@aol.com','philjones@gmail.com', None, np.nan, 'AlanDoe@email.com'],
    'age' : ['33','55','63',None, None, 'Missing']
}

In [4]:
df = pd.DataFrame(people)

In [6]:
df

      first      last                email      age
0      Alex  McIntosh  alexmc124@gmail.com       33
1    Donald     Smith     donald88@aol.com       55
2  Phillipa     Jones  philjones@gmail.com       63
3       NaN       NaN                 None     None
4      None       NaN                  NaN     None
5        NA   Missing    AlanDoe@email.com  Missing

In [7]:
df.dropna()

      first      last                email      age
0      Alex  McIntosh  alexmc124@gmail.com       33
1    Donald     Smith     donald88@aol.com       55
2  Phillipa     Jones  philjones@gmail.com       63
5        NA   Missing    AlanDoe@email.com  Missing

In [9]:
df.dropna(axis='index', how='all')

      first      last                email      age
0      Alex  McIntosh  alexmc124@gmail.com       33
1    Donald     Smith     donald88@aol.com       55
2  Phillipa     Jones  philjones@gmail.com       63
5        NA   Missing    AlanDoe@email.com  Missing

In [17]:
df.replace('NA', np.nan, inplace=True),
df.replace('None', np.nan, inplace=True),
df.replace('Missing', np.nan, inplace=True)

df

      first      last                email   age
0      Alex  McIntosh  alexmc124@gmail.com    33
1    Donald     Smith     donald88@aol.com    55
2  Phillipa     Jones  philjones@gmail.com    63
3       NaN       NaN                 None  None
4      None       NaN                  NaN  None
5       NaN       NaN    AlanDoe@email.com   NaN

In [18]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3   True   True   True   True
4   True   True   True   True
5   True   True  False   True

In [19]:
df.fillna('Missing')

      first      last                email      age
0      Alex  McIntosh  alexmc124@gmail.com       33
1    Donald     Smith     donald88@aol.com       55
2  Phillipa     Jones  philjones@gmail.com       63
3   Missing   Missing              Missing  Missing
4   Missing   Missing              Missing  Missing
5   Missing   Missing    AlanDoe@email.com  Missing

In [20]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [23]:
df['age'] = df['age'].astype(float)

In [25]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [26]:
df['age'].mean()

50.333333333333336

In [27]:
# when reading in a csv 
na_vals = ['NA', 'Missing']
df2 = pd.read_csv('data/survey_results_public.csv', index_col='Respondent', na_values=na_vals)
schema_df2 = pd.read_csv('data/survey_results_schema.csv', index_col='Column')

In [30]:
df2['YearsCode']

Respondent
1          4
2        NaN
3          3
4          3
5         16
        ...
88377    NaN
88601    NaN
88802    NaN
88816    NaN
88863      8
Name: YearsCode, Length: 88883, dtype: object

In [32]:
df2['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [33]:
df2['YearsCode'].replace('Less than 1 year', 0, inplace=True)

In [34]:
df2['YearsCode'].replace('More than 50 years', 51, inplace=True)

In [36]:
df2['YearsCode'] = df2['YearsCode'].astype(float)

In [37]:
df2['YearsCode']

Respondent
1         4.0
2         NaN
3         3.0
4         3.0
5        16.0
         ...
88377     NaN
88601     NaN
88802     NaN
88816     NaN
88863     8.0
Name: YearsCode, Length: 88883, dtype: float64